blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at Desc, title ASC LIMIT 1  [["user_id", 914507133], ["id", 517600287]]
---
  def edit
    @article = current_user.articles.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Lorem Ipsum"], ["created_at", "2015-02-19 00:25:24.931420"], ["title", "Integration Tests"], ["updated_at", "2015-02-19 00:25:24.931420"], ["user_id", 914507133]]
---
  def create
    @article = current_user.articles.new(article_params)

    respond_to do |format|
      if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at Desc, title ASC LIMIT 1  [["user_id", 914507133], ["id", 517600287]]
UPDATE "articles" SET "excerpt" = ?, "location" = ?, "published_at" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 6  [["excerpt", ""], ["location", ""], ["published_at", "2015-01-14 01:46:00.000000"], ["title", "One-to-man y associations"], ["updated_at", "2015-01-14 01:46:06.952398"]]
---
  def update
    @article = current_user.articles.find(params[:id])
    respond_to do |format|
      if @article.update(article_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at Desc, title ASC LIMIT 1  [["user_id", 914507133], ["id", 517600287]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 517600287]]
---
  def destroy
    @article = current_user.articles.find(params[:id])
    @article.destroy

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
  def notify_friend
    @article = Article.find(params[:id])