blog/app/controllers/comments_controller.rb

	def create
		@comment = @article.comments.new(comment_params)
		if @comment.save
---
INSERT INTO "comments" ("article_id", "body", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["article_id", 7], ["body", "This is a comment"], ["created_at", "2015-01-16 02:04:35.562104"], ["email", "JohnDoe@email.com"], ["name", "John"], ["updated_at", "2015-01-16 02:04:35.562104"]]

	def destroy
		@article = current_user.articles.find(params[:article_id])
		@comment = @article.comments.find(params[:id])
		@comment.destroy
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at Desc, title ASC LIMIT 1  [["user_id", 3], ["id", 10]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 10], ["id", 7]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]

	def load_article
		@article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 9]]