blog/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-15 02:13:45.136480"], ["email", "Bricebathel@hotmail.com"], ["hashed_password", "b07ab99fdb1b65536ffd5018cd09029ea0a4df76"], ["updated_at", "2015-01-15 02:13:45.136480"]]